; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 41320 2 1 4 6 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image3 - mode
	image2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	Star0 - direction
	Star1 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 thermograph1)
	(supports instrument1 image3)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
)
(:goal (and
	(pointing satellite1 Phenomenon6)
	(have_image Phenomenon6 image3)
	(have_image Phenomenon7 thermograph1)
	(have_image Planet8 thermograph1)
	(have_image Planet9 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (turn_to satellite1 planet9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet9)
   goals met: 0 of 5
4. (turn_to satellite0 planet8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet8)
   goals met: 0 of 5
5. (turn_to satellite0 phenomenon7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon7)
   goals met: 0 of 5
6. (turn_to satellite1 groundstation3 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 5
7. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 5
8. (turn_to satellite0 planet8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet8)
   goals met: 0 of 5
9. (turn_to satellite1 planet9 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet9)
   goals met: 0 of 5
10. (turn_to satellite0 groundstation2 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 5
11. (take_image satellite1 planet9 instrument1 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 1 of 5
12. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 5
13. (turn_to satellite1 phenomenon6 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 5
14. (turn_to satellite0 planet8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet8)
   goals met: 2 of 5
15. (take_image satellite1 phenomenon6 instrument1 image3)
   added: (have_image phenomenon6 image3)
   goals met: 3 of 5
16. (take_image satellite0 planet8 instrument0 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 4 of 5
17. (turn_to satellite1 phenomenon7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 5
18. (turn_to satellite0 phenomenon7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 5
19. (take_image satellite1 phenomenon7 instrument1 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 4 of 5
20. (turn_to satellite1 phenomenon6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon6)
   goals met: 5 of 5
